import type { Question } from '../types/Question';

export const questions: Question[] = [
  {
    id: 1,
    question: "Какая органелла клетки отвечает за производство энергии?",
    options: ["Ядро", "Митохондрия", "Рибосома", "Лизосома"],
    correctAnswer: "Митохондрия"
  },
  {
    id: 2,
    question: "Сколько хромосом у здорового человека?",
    options: ["42", "44", "46", "48"],
    correctAnswer: "46"
  },
  {
    id: 3,
    question: "Какой газ растения поглощают в процессе фотосинтеза?",
    options: ["Кислород", "Азот", "Углекислый газ", "Водород"],
    correctAnswer: "Углекислый газ"
  },
  {
    id: 4,
    question: "Какая группа крови считается универсальным донором?",
    options: ["I (0)", "II (A)", "III (B)", "IV (AB)"],
    correctAnswer: "I (0)"
  },
  {
    id: 5,
    question: "Какой орган человека является самым большим?",
    options: ["Печень", "Мозг", "Кожа", "Сердце"],
    correctAnswer: "Кожа"
  },
  {
    id: 6,
    question: "Как называется процесс деления клетки?",
    options: ["Митоз", "Мейоз", "Оба варианта верны", "Ни один из вариантов"],
    correctAnswer: "Оба варианта верны"
  },
  {
    id: 7,
    question: "Какой витамин вырабатывается в коже под воздействием солнца?",
    options: ["Витамин A", "Витамин C", "Витамин D", "Витамин E"],
    correctAnswer: "Витамин D"
  },
  {
    id: 8,
    question: "Сколько камер в сердце человека?",
    options: ["2", "3", "4", "5"],
    correctAnswer: "4"
  }
];